In [1]:
import pandas as pd
import numpy as np

In [2]:
cars={'Brand':['Suzuki','Toyoto','Honda','Lambergini'],
      'Price':[2000,25000,22000,45000]}

In [3]:
df=pd.DataFrame(cars)
df

        Brand  Price
0      Suzuki   2000
1      Toyoto  25000
2       Honda  22000
3  Lambergini  45000

# Data Frame using list data

In [4]:
list1=['samina','samira','samia','samiha']
df=pd.DataFrame(list1)
df

        0
0  samina
1  samira
2   samia
3  samiha

In [5]:
names=['samina','samira','samia','samiha'] ###creating multiple column
age=[20,21,22,23]
height_cm=[140,150,160,170]
df=pd.DataFrame(list(zip(names,age,height_cm)))
df

        0   1    2
0  samina  20  140
1  samira  21  150
2   samia  22  160
3  samiha  23  170

In [6]:
names=['samina','samira','samia','samiha'] ## multiple column and  column name
age=[20,21,22,23]
height_cm=[140,150,160,170]
df=pd.DataFrame(list(zip(names,age,height_cm)),columns=['Name','Age','Height in cm'])
df

     Name  Age  Height in cm
0  samina   20           140
1  samira   21           150
2   samia   22           160
3  samiha   23           170

# DataFrame from list  dicionaries

In [7]:
list1=[
    {'Name':'sagor','Age':23,'Gender':'M'},
     {'Name':'arif','Age':29,'Gender':'M'},
     {'Name':'anik','Age':21,'Gender':'M'},
     {'Name':'khosru','Age':26,'Gender':'M'},
     {'Name':'fahim','Age':24,'Gender':'F'},
]

In [9]:
df=pd.DataFrame(list1)
df

     Name  Age Gender
0   sagor   23      M
1    arif   29      M
2    anik   21      M
3  khosru   26      M
4   fahim   24      F